<?xml version="1.0" ?>
<net name="main_graph" version="11">
    <layers>
        <layer id="0" name="images" type="Parameter" version="opset1">
            <data shape="1,3,640,640" element_type="f32"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="images"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="images">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>640</dim>
                    <dim>640</dim>
                </port>
            </output>
        </layer>
        <layer id="1" name="model.0.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.0.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.0.conv.weight">
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="2" name="Convolution_154" type="Convolution" version="opset1">
            <data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_154"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>640</dim>
                    <dim>640</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
            </output>
        </layer>
        <layer id="3" name="Reshape_174" type="Const" version="opset1">
            <data element_type="f32" shape="1, 16, 1, 1" offset="1728" size="64"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="4" name="/model.0/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.0/conv/Conv_output_0, Concat_173, Reshape_174"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.0/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
            </output>
        </layer>
        <layer id="5" name="/model.0/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.0/act/Mul_output_0, /model.0/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.0/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
            </output>
        </layer>
        <layer id="6" name="model.1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 16, 3, 3" offset="1792" size="18432"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.1.conv.weight">
                    <dim>32</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="7" name="Convolution_204" type="Convolution" version="opset1">
            <data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_204"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>320</dim>
                    <dim>320</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="8" name="Reshape_224" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="20224" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="9" name="/model.1/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.1/conv/Conv_output_0, Concat_223, Reshape_224"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.1/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="10" name="/model.1/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.1/act/Mul_output_0, /model.1/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.1/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="11" name="model.2.cv1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 32, 1, 1" offset="20352" size="4096"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.2.cv1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.2.cv1.conv.weight">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="12" name="Convolution_254" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_254"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="13" name="Reshape_274" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="24448" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="14" name="/model.2/cv1/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/cv1/conv/Conv_output_0, Concat_273, Reshape_274"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.2/cv1/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="15" name="/model.2/cv1/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/cv1/act/Mul_output_0, /model.2/cv1/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.2/cv1/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="16" name="Constant_305" type="Const" version="opset1">
            <data element_type="i64" shape="" offset="24576" size="8"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Constant_305"/>
            </rt_info>
            <output>
                <port id="0" precision="I64"/>
            </output>
        </layer>
        <layer id="17" name="onnx::Split_163" type="Const" version="opset1">
            <data element_type="i64" shape="2" offset="24584" size="16"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="onnx::Split_163"/>
            </rt_info>
            <output>
                <port id="0" precision="I64" names="onnx::Split_163">
                    <dim>2</dim>
                </port>
            </output>
        </layer>
        <layer id="18" name="/model.2/Split_output_1" type="VariadicSplit" version="opset1">
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.2/Split_output_1"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="I64"/>
                <port id="2" precision="I64">
                    <dim>2</dim>
                </port>
            </input>
            <output>
                <port id="3" precision="FP32" names="/model.2/Split_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="4" precision="FP32" names="/model.2/Split_output_1">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="19" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="16, 16, 3, 3" offset="24600" size="9216"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.2.m.0.cv1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.2.m.0.cv1.conv.weight">
                    <dim>16</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="20" name="Convolution_307" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_307"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>16</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="21" name="Reshape_327" type="Const" version="opset1">
            <data element_type="f32" shape="1, 16, 1, 1" offset="33816" size="64"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="22" name="/model.2/m.0/cv1/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/m.0/cv1/conv/Conv_output_0, Concat_326, Reshape_327"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.2/m.0/cv1/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="23" name="/model.2/m.0/cv1/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/m.0/cv1/act/Mul_output_0, /model.2/m.0/cv1/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.2/m.0/cv1/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="24" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="16, 16, 3, 3" offset="33880" size="9216"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.2.m.0.cv2.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.2.m.0.cv2.conv.weight">
                    <dim>16</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="25" name="Convolution_357" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_357"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>16</dim>
                    <dim>16</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="26" name="Reshape_377" type="Const" version="opset1">
            <data element_type="f32" shape="1, 16, 1, 1" offset="43096" size="64"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="27" name="/model.2/m.0/cv2/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/m.0/cv2/conv/Conv_output_0, Concat_376, Reshape_377"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.2/m.0/cv2/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="28" name="/model.2/m.0/cv2/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/m.0/cv2/act/Mul_output_0, /model.2/m.0/cv2/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.2/m.0/cv2/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="29" name="/model.2/m.0/Add_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.2/m.0/Add_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.2/m.0/Add_output_0">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="30" name="/model.2/Concat_output_0" type="Concat" version="opset1">
            <data axis="1"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.2/Concat_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="3" precision="FP32" names="/model.2/Concat_output_0">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="31" name="model.2.cv2.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 48, 1, 1" offset="43160" size="6144"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.2.cv2.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.2.cv2.conv.weight">
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="32" name="Convolution_409" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_409"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="33" name="Reshape_429" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="49304" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="34" name="/model.2/cv2/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/cv2/conv/Conv_output_0, Concat_428, Reshape_429"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.2/cv2/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="35" name="/model.2/cv2/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.2/cv2/act/Mul_output_0, /model.2/cv2/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.2/cv2/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
            </output>
        </layer>
        <layer id="36" name="model.3.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="64, 32, 3, 3" offset="49432" size="73728"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.3.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.3.conv.weight">
                    <dim>64</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="37" name="Convolution_459" type="Convolution" version="opset1">
            <data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_459"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>160</dim>
                    <dim>160</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>64</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="38" name="Reshape_479" type="Const" version="opset1">
            <data element_type="f32" shape="1, 64, 1, 1" offset="123160" size="256"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="39" name="/model.3/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.3/conv/Conv_output_0, Concat_478, Reshape_479"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.3/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="40" name="/model.3/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.3/act/Mul_output_0, /model.3/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.3/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="41" name="model.4.cv1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="64, 64, 1, 1" offset="123416" size="16384"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.4.cv1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.4.cv1.conv.weight">
                    <dim>64</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="42" name="Convolution_509" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_509"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>64</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="43" name="Reshape_529" type="Const" version="opset1">
            <data element_type="f32" shape="1, 64, 1, 1" offset="139800" size="256"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="44" name="/model.4/cv1/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/cv1/conv/Conv_output_0, Concat_528, Reshape_529"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.4/cv1/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="45" name="/model.4/cv1/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/cv1/act/Mul_output_0, /model.4/cv1/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.4/cv1/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="46" name="Constant_560" type="Const" version="opset1">
            <data element_type="i64" shape="" offset="24576" size="8"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Constant_560"/>
            </rt_info>
            <output>
                <port id="0" precision="I64"/>
            </output>
        </layer>
        <layer id="47" name="onnx::Split_183" type="Const" version="opset1">
            <data element_type="i64" shape="2" offset="140056" size="16"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="onnx::Split_183"/>
            </rt_info>
            <output>
                <port id="0" precision="I64" names="onnx::Split_183">
                    <dim>2</dim>
                </port>
            </output>
        </layer>
        <layer id="48" name="/model.4/Split_output_1" type="VariadicSplit" version="opset1">
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.4/Split_output_1"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="I64"/>
                <port id="2" precision="I64">
                    <dim>2</dim>
                </port>
            </input>
            <output>
                <port id="3" precision="FP32" names="/model.4/Split_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="4" precision="FP32" names="/model.4/Split_output_1">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="49" name="model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 32, 3, 3" offset="140072" size="36864"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.4.m.0.cv1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.4.m.0.cv1.conv.weight">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="50" name="Convolution_562" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_562"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="51" name="Reshape_582" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="176936" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="52" name="/model.4/m.0/cv1/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/m.0/cv1/conv/Conv_output_0, Concat_581, Reshape_582"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.4/m.0/cv1/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="53" name="/model.4/m.0/cv1/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/m.0/cv1/act/Mul_output_0, /model.4/m.0/cv1/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.4/m.0/cv1/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="54" name="model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 32, 3, 3" offset="177064" size="36864"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.4.m.0.cv2.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.4.m.0.cv2.conv.weight">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="55" name="Convolution_612" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_612"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="56" name="Reshape_632" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="213928" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="57" name="/model.4/m.0/cv2/conv/Conv_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/m.0/cv2/conv/Conv_output_0, Concat_631, Reshape_632"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.4/m.0/cv2/conv/Conv_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="58" name="/model.4/m.0/cv2/act/Mul_output_0" type="Swish" version="opset4">
            <rt_info>
                <attribute name="fused_names" version="0"
                           value="/model.4/m.0/cv2/act/Mul_output_0, /model.4/m.0/cv2/act/Sigmoid_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </input>
            <output>
                <port id="1" precision="FP32" names="/model.4/m.0/cv2/act/Mul_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="59" name="/model.4/m.0/Add_output_0" type="Add" version="opset1">
            <data auto_broadcast="numpy"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="/model.4/m.0/Add_output_0"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="/model.4/m.0/Add_output_0">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="60" name="model.4.m.1.cv1.conv.weight" type="Const" version="opset1">
            <data element_type="f32" shape="32, 32, 3, 3" offset="214056" size="36864"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="model.4.m.1.cv1.conv.weight"/>
            </rt_info>
            <output>
                <port id="0" precision="FP32" names="model.4.m.1.cv1.conv.weight">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="61" name="Convolution_663" type="Convolution" version="opset1">
            <data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
            <rt_info>
                <attribute name="fused_names" version="0" value="Convolution_663"/>
            </rt_info>
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
                <port id="1" precision="FP32">
                    <dim>32</dim>
                    <dim>32</dim>
                    <dim>3</dim>
                    <dim>3</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>80</dim>
                    <dim>80</dim>
                </port>
            </output>
        </layer>
        <layer id="62" name="Reshape_683" type="Const" version="opset1">
            <data element_type="f32" shape="1, 32, 1, 1" offset="250920" size="128"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
